Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: (If that object can’t respond to the message either, it too will be given a chance to forward it.)
ja: （そのオブジェクトもまたメッセージに応答出来ないならば、それもまたそれを転送する機会を与えられます。）

source: (In an AppleScript script, a handler is the equivalent of a function.) However, you cannot use this method to send Apple events to other applications.
ja: （AppleScriptスクリプトにおいて、ハンドラは関数に相当します。）しかしながら、あなたはアップルイベントを他のアプリケーションに送信するためにこのメソッドを使うことはできません。

source: (In macOS, the top-level non-localized resource directory is typically called Resources but in iOS, it is the main bundle directory.)
ja: （macOSにおいて、トップレベルのローカライズされないリソースディレクトリは、たいていはResourcesと呼ばれます、しかしiOSでは、それはメインバンドルディレクトリです。）

source: (In macOS, the top-level nonlocalized resource directory is typically called Resources but in iOS, it is the main bundle directory.) For example, suppose you have a Mac app with a modern bundle and you specify @"Documentation" for the subpath parameter.
ja: （macOSにおいて、トップレベルのローカライズされないリソースディレクトリは、たいていはResourcesと呼ばれます、しかしiOSでは、それはメインバンドルディレクトリです。）例えば、あなたがモダンバンドルを持つMacアプリを持つと仮定すると、あなたは@"Documentation"をsubpath パラメータに対して指定します。

source: (Irreflexivity)
ja: （非反射）

source: (Logically, since an exact match searches indefinitely into the future, if no match is found there’s no point in continuing the enumeration.)
ja: （論理的に、厳密な合致は無限に未来へと検索することから、合致するものが見つからないならばこの列挙を続けても利益がありません。）

source: (Obviously if you return self from this method, the code would just fall into an infinite loop.)
ja: （当然ながらあなたがselfをこのメソッドから返したならば、コードはあるいは無限ループに陥るでしょう。）

source: (Optional) Provide any additional configuration for the connection.
ja: （任意）何らかの追加の構成設定を接続に対して提供してください。

source: (Reflexivity)
ja: （反射性）

source: (See also the Discussion section.)
ja: （またDiscussion節を見てください。）

source: (See the specification of the NSString class for formatting and localizing details.)
ja: （NSStringクラスの仕様を書式設定およびローカライズの詳細として見てください。）

source: (Symmetry)
ja: （対称性）

source: (The search order for the language-specific directories corresponds to the user’s preferences.) For details on how localized resources are found, read The Bundle Search Pattern in Bundle Programming Guide.
ja: （言語固有のディレクトリに対する検索順序はユーザの環境設定と一致します。）どのようにローカライズされたリソースが見つけられるかに関する詳細は、The Bundle Search PatternをBundle Programming Guideで読んでください。

source: (The search order for the language-specific directories corresponds to the user’s preferences.) This method does not recurse through any other subdirectories at any of these locations.
ja: （言語固有のディレクトリに対する検索順序はユーザの環境設定と一致します。）このメソッドは、これらの位置のどれかでの何か他の下位ディレクトリを始めから終わりまで再帰呼び出ししません。

source: (The search order for the language-specific folders corresponds to the user’s preferences.) It does not recurse through other subfolders at any of these locations.
ja: （言語固有のフォルダに対する検索順序はユーザの環境設定と一致します。）それは、これらの位置のどれかでの他の下位フォルダを始めから終わりまで再帰呼び出ししません。

source: (The system extends your app’s sandbox privileges to give it access to files it moves to iCloud.) You can also use this method to move files out of iCloud and back into a local directory.
ja: （システムは、あなたのアプリの持つサンドボックス特権を拡張して、それがiCloudに移動するファイルへのアクセスをそれに与えます。）あなたはまたこのメソッドを使ってファイルをiCloudの外に移動して、そしてローカルディレクトリに戻すことができます。

source: (This debugging information should not be displayed to the user.) You can obtain the debugging information by invoking the error object’s description method in your code or by using the print-object command on the error object in gdb.
ja: （このデバッグ情報は、ユーザに表示されるべきではありません。）あなたは、エラーオブジェクトの持つdescriptionメソッドをあなたのコードにおいて呼び出すことで、またはprint-objectコマンドをエラーオブジェクト上でgdbにおいて使うことで、デバッグ情報を取得できます。

source: (To establish outlet connections, this method uses the set Value: for Key: method, which may cause the object in the outlet to be retained automatically.) For detailed information about the nib-loading process, see Resource Programming Guide.
ja: （アウトレット接続を確立するために、このメソッドはset Value: for Key:メソッドを使います、それはアウトレットの中のオブジェクトが自動的にリテインされることを引き起こすかもしれません。）nibロード処理についての詳細情報として、Resource Programming Guideを見てください。

source: (Transitive comparability)
ja: （推移的比較性）

source: (Transitive incomparability)
ja: （推移的比較不能性）

source: (Transitivity)
ja: （推移性）

source: (read-only)
ja: （読み出しのみ）

source: , b}, {c, d}}”, where a, b, c, and d are the x and y coordinates and the width and height, respectively, of a Rect.
ja: そこにおいてa、b、c、そして d は、めいめい、a Rectの x と y 座標および幅と高さです。

source: , b}”, where a and b are non-negative integers representing a Range.
ja: そこでaとbは非負整数で、a Rangeを表しています。

source: , b}”, where a and b are the x and y coordinates of a Point.
ja: , b}” 由来の、そこでaとbはa Pointの座標のxとy座標です。

source: , y}” an NSPoint structure that uses x and y as the x and y coordinates, in that order.
ja: x と y を、その順番で x と y 座標として使うNSPoint構造体です。

source: / A for-in loop over 'ranges' accesses each range:
ja: / 「ranges」に対するfor-inループは、各範囲にアクセスします：

source: / A set is never a strict subset of itself:
ja: / A集合は決してそれ自身の狭義の下位集合ではありません。

source: / A set is never a strict superset of itself:
ja: / A集合は決してそれ自身の狭義の上位集合ではありません：

source: / Adding a property of a custom Codable type maintains overall Codable conformance.
ja: / あつらえのCodable 型のプロパティを加えることは、 Codable 準拠の何もかもを保守します。

source: / All successes are equivalent, so none is before any other
ja: / すべての成功は等しい、なので何か他の前に来るものはありません

source: / Can only ship standard or priority to PO Boxes
ja: / 標準または優先のみが私書箱に出荷できるなら

source: / Cast the proxy object to the interface's protocol.
ja: / プロキシオブジェクトをインターフェイスのプロトコルへキャストする。

source: / Check to see if an error occurred.
ja: / エラーが発生したか見るために調べる。

source: / Create two dates that are exactly 1 day apart.
ja: / 正確に１日隔たった２つの日付を作成します。

source: / Double, String, and Int all conform to Codable.
ja: / Double, String, そして Int は全て Codable に準拠します。

source: / Get the bundle containing the specified private class.
ja: / 指定されたプライベートクラスを含んでいるバンドルを取得する。

source: / Get the list of services available for an item at the given URL.
ja: / 与えられたURLで項目に対して利用可能なサービスのリストを得る。

source: / Get the proxy object.
ja: / プロキシオブジェクトを得る。

source: / Handle the error here...
ja: / エラーをここで処理する...

source: / If the interface is set up properly, this should never fail.
ja: / インターフェイスが適切に準備されるならば、これは決して失敗すべきではない。

source: / Landmark is still codable after adding these properties.
ja: / Landmark は、これらのプロパティを加える後も依然としてコード化可能です。

source: / Landmark now supports the Codable methods init(from:) and encode(to:),
ja: / Landmark は、現在 Codable メソッド init(from:) と encode(to:) をサポートします、

source: / No connection object found.
ja: / 接続オブジェクトが見つからなかった。

source: / Order errors before successes
ja: / 成功の前にエラーを並べる

source: / Order errors by code
ja: / エラーをコードによって並べる

source: / Set the remote interface.
ja: / リモートインターフェイスを設定する。

source: / Start the connection.
ja: / 接続を開始する。

source: / The named service is available for the item at the provided URL.
ja: / この名前付きサービスは提供されたURLで項目に対して利用可能である。

source: / To use the service, get the connection object.
ja: / このサービスを使うには、接続オブジェクトを得てください。

source: / Use 'joined()' to access each element of each range:
ja: / 「joined()」を使うことで、各範囲の各要素にアクセスしてください：

source: / Use the configured formatter to generate the string.
ja: / 構成設定されたフォーマッタを使って文字列を生成します。

source: / You can now use the proxy to call the service's custom actions.
ja: / あなたは現在プロキシを使ってサービスの持つあつらえのアクションを呼び出せます。

source: / even though they aren't written as part of its declaration.
ja: / それらがそれの宣言の一部として書かれないとしてもです。

source: 32-bit UTF encoding.
ja: 32-bit UTF 符号化。

source: 7-bit verbose ASCII to represent all Unicode characters.
ja: 7-bit 冗長 ASCII、全てのUnicode文字を表すため。

source: 8-bit ASCII encoding with NEXTSTEP extensions.
ja: 8-bit ASCII エンコーディング、NEXTSTEP拡張付き。

source: 8-bit Adobe Symbol encoding vector.
ja: 8-bit Adobe Symbol 符号化ベクター。

source: 8-bit EUC encoding for Japanese text.
ja: 8-bit EUC 符号化、日本語テキスト用。

source: 8-bit ISO Latin 1 encoding.
ja: 8-bit ISO Latin 1 符号化。

source: 8-bit ISO Latin 2 encoding.
ja: 8-bit ISO Latin 2 符号化。

source: 8-bit Shift-JIS encoding for Japanese text.
ja: 8-bit Shift-JIS 符号化、日本語テキスト用。

source: Byte Count Formatter .Units values can be combined using the C OR operator to specify complex formatting strings.
ja: Byte Count Formatter .Units値は、CのOR演算子を使って結合されることで、複雑な書式設定文字列を指定できます。

source: Decimal instances are represented in memory as a mantissa and an exponent, expressing the value mantissa x 10^exponent.
ja: Decimalインスタンスは、メモリ中に仮数と指数として表されます、値は仮数 x 10^指数として表現します。

source: NSObject provides an implementation of the NSKeyValueObserving protocol that provides an automatic observing capability for all objects.
ja: NSObjectは、NSKeyValueObservingプロトコルのある実装を提供します、それはすべてのオブジェクトに対して自動監視能力を提供します。

source: progress and completed matching flags have no effect for methods other than this method.
ja: progressとcompletedマッチングフラグは、このメソッド以外のメソッドには効果がありません。

source: with Transparent Bounds and without Anchoring Bounds matching options have no effect if the search range covers the entire string.
ja: 検索範囲が全文字列をカバーするならば、マッチング・オプションwith Transparent Boundsとwithout Anchoring Boundsは効果がありません。

source: RFC 3339 Date and Time
ja: RFC 3339 日付と時刻

source: Table 1 describe the character sequences used to match characters within a string.
ja: 表 1は、ある文字列内のなんらかの文字にマッチするために使われる文字表記を記述します。

source: UIKit and AppKit supply specialized names for the first two index path nodes for use when working with table views and collection views.
ja: UIKitとAppKitは、テーブルビューおよびコレクションビューを扱う場合に使用するために最初の２つのインデックスパスノードに対して特殊化された名前を供給します。

source: Table 3 describes the syntax.
ja: 表 3は、構文を記述します。

source: hfs Creator Code and hfs Type Code will only be heeded when path specifies a file.
ja: hfs Creator Codeとhfs Type Codeは、pathがファイルを指定する場合に留意されるだけです。

source: Decimal instances can represent a number with up to 38 significant digits.
ja: Decimalインスタンスは、ある数を38の有効桁まで表せます。

source: (true, new Member) if new Member was not contained in self.
ja: (true, new Member)、もしnew Memberがselfに含まれなかったならば。

source: -1 means that the operation failed; more information about the error can be obtained with stream Error.
ja: -1は、操作が失敗したことを意味します；エラーについてのさらなる情報はstream Errorで獲得されることができます。

source: .ordered Same if the two dates are equal in the given component and all larger components; otherwise, either .ordered Ascending or .ordered Descending.
ja: 与えられた構成要素そして全てのより大きい構成要素において２つの日付が等しいならば.ordered Same；そうでなければ、.ordered Ascendingまたは.ordered Descendingのどちらか。

source: 0 indicates that the end of the buffer was reached.
ja: 0は、バッファの終わりに達したことを指し示します。

source: 0 or NSScanned Option: A value of 0 allocates non-scanned memory; a value of NSScanned Option allocates scanned memory.
ja: 0またはNSScanned Option：0の値は非スキャンメモリをアロケートします；NSScanned Optionの値は、スキャンメモリをアロケートします。

source: Calendar encapsulates information about systems of reckoning time in which the beginning, length, and divisions of a year are defined.
ja: Calendarは、ある年の始まり、長さ、そしていくつかの区分が定義されるところのさまざまな刻時体系についての情報をカプセル化します。

source: Data allocates additional memory as needed, so capacity simply establishes the initial capacity.
ja: Dataは追加のメモリを必要とされるだけアロケートします、なのでcapacityは単に初期容量を確立します。

source: Data bridges to the NSData class and its mutable subclass, NSMutable Data.
ja: Dataは、NSDataクラスとそれの可変のサブクラス、NSMutable Dataにブリッジします。

source: Date bridges to the NSDate class.
ja: Dateは、NSDateクラスへとブリッジします。

source: Date Components encapsulates the components of a date in an extendable, structured manner.
ja: Date Componentsは、ある日付の構成要素を、拡張可能な、構造化流儀においてカプセル化します。

source: Host methods are thread-safe.
ja: Hostメソッドは、スレッド安全です。

source: Input Stream is “toll-free bridged” with its Core Foundation counterpart, CFRead Stream.
ja: Input Streamは、それのCore Foundation相当物、CFRead Streamと「トールフリーブリッジ（通行料無料の橋渡し）」されます。

source: NSApple Event Manager supports these mechanisms by providing methods to register and remove handlers and to dispatch Apple events to the appropriate handler, if one exists.
ja: NSApple Event Managerは、ハンドラの登録と除去をするためにそしてアップルイベントを適切なハンドラーに、もしそれが存在すれば、発送するためにメソッドを提供することによってこれらの仕組みを支えます。

source: NSApple Script provides the execute Apple Event(_: error:) method so that you can send an Apple event to invoke a handler in a script.
ja: NSApple Scriptは、execute Apple Event(_: error:)メソッドを提供します、それであなたはアップルイベントを送信してスクリプトにおいてあるハンドラーを発動することができます。

source: NSArray and its subclass NSMutable Array manage ordered collections of objects called arrays.
ja: NSArrayとそれのサブクラスNSMutable Arrayは、オブジェクトの順番付けられたコレクション、配列と呼ばれるものを管理します。

source: NSArray is “toll-free bridged” with its Core Foundation counterpart, CFArray.
ja: NSArrayは、それのCore Foundationコンポーネント、CFArrayと「トールフリーブリッジ」されます。

source: NSArray objects are not observable, so this method raises an exception when invoked on an NSArray object.
ja: NSArrayオブジェクトは監視可能ではありません、それでこのメソッドはNSArrayオブジェクト上で発動される場合は例外を引き起こします。

source: NSAssertion Handler objects are automatically created to handle false assertions.
ja: NSAssertion Handlerオブジェクトは、falseアサーションを取り扱うために自動的に作成されます。

source: NSCalendar objects encapsulate information about systems of reckoning time in which the beginning, length, and divisions of a year are defined.
ja: NSCalendarオブジェクトは、ある年の始まり、長さ、そしていくつかの区分が定義されるさまざまな刻時体系についての情報をカプセル化します。

source: NSCalendar Date is no longer supported; you should not use this method.
ja: NSCalendar Dateはもはやサポートされません；あなたはこのメソッドを使うべきではありません。

source: NSDate objects encapsulate a single point in time, independent of any particular calendrical system or time zone.
ja: NSDateオブジェクトは、あらゆる特定の暦体系またはタイムゾーンから独立して、時間の中のある一点をカプセル化します。

source: NSDate Components encapsulates the components of a date in an extendable, object-oriented manner.
ja: NSDate Componentsは、あるデータの構成要素を、ある拡張可能な、オブジェクト指向の流儀でカプセル化します。

source: NSDecimal Number, an immutable subclass of NSNumber, provides an object-oriented wrapper for doing base-10 arithmetic.
ja: NSDecimal Number、NSNumberの不変のサブクラスは、オブジェクト指向ラッパーを10進数計算を行うのために提供します。

source: NSDistributed Notification Center does not implement a secure communications protocol.
ja: NSDistributed Notification Centerは、安全な通信プロトコルを実装しません。

source: NSDistributed Notification Center objects should not be used to send notifications between threads within the same task.
ja: NSDistributed Notification Centerオブジェクトは、同じタスク内部のスレッド間で通知を送るために使われるべきではありません。

source: NSError codes in the Cocoa error domain.
ja: Cocoaエラー領域中のNSErrorコード。

source: NSExecutable Architecture Mismatch Error - returned if the bundle executable does not include code that matches the processor architecture of the current processor.
ja: NSExecutable Architecture Mismatch Error - バンドルの実行可能ファイルが現在のプロセッサのプロセッサアーキテクチャと合致するコードを含まないならば返されます。

source: NSExecutable Link Error - returned if the executable failed to load due to link errors but is otherwise alright.
ja: NSExecutable Link Error - 実行可能ファイルがリンクエラーのためにロードに失敗したしかしそれ以外では問題ないならば返されます。

source: NSExecutable Load Error - returned if the bundle’s executable failed to load for some detectable reason prior to linking.
ja: NSExecutable Load Error - バンドルの持つ実行可能ファイルが、リンクに先立って何らかの検出可能な理由のためロードに失敗するならば返されます。

source: NSExecutable Not Loadable Error - returned if the bundle’s executable file exists but could not be loaded.
ja: NSExecutable Not Loadable Error - バンドルの持つ実行可能ファイルが存在する、しかしロードされることができなかったならば返されます。

source: NSExecutable Runtime Mismatch Error - returned if the bundle’s required Objective-C runtime information is not compatible with the runtime of the current process.
ja: NSExecutable Runtime Mismatch Error - バンドルの持つ必須Objective-Cランタイム情報が現在のプロセスのランタイムと互換性がないならば返されます。

source: NSFile Handle posts several notifications related to asynchronous background I/O operations.
ja: NSFile Handleは、非同期バックグラウンドI/O演算に関連したいくらかの通知を投函します。

source: NSFile No Such File Error - returned if the bundle’s executable file was not located.
ja: NSFile No Such File Error - バンドルの持つ実行可能ファイルが捜し出されなかったならば返されます。

source: NSFormatter is intended for subclassing.
ja: NSFormatter、サブクラス作成のために作られます。

source: NSHTTPCookie Accept Policy specifies the cookie acceptance policies implemented by the NSHTTPCookie Storage class.
ja: NSHTTPCookie Accept Policyは、NSHTTPCookie Storageクラスによって実装されるクッキー受入方針を指定します。

source: NSHost object for the process’s host.
ja: プロセスの持つホストに対するNSHostオブジェクト。

source: NSInput Stream is an abstract superclass of a class cluster consisting of concrete subclasses of NSStream that provide standard read-only access to stream data.
ja: NSInput Streamは、NSStreamの具象サブクラスいくらかからなるクラスクラスタの抽象スーパークラスで、それは標準的読み出し専用アクセスをストリームデータに提供します。

source: NSObject does not itself support the NSCopying protocol.
ja: NSObjectは、それ自身はNSCopyingプロトコルをサポートしません。

source: NSObject's implementation of this method simply prints the name of the class.
ja: このメソッドのNSObjectの持つ実装は、単純にクラスの名前を出力します。

source: NSObject’s implementation of attribute Keys simply calls [[self class Description] attribute Keys].
ja: NSObjectの持つattribute Keysの実装は、単に[[self class Description] attribute Keys]を呼び出します。

source: NSObject’s implementation of forward Invocation: simply invokes the does Not Recognize Selector: method; it doesn’t forward any messages.
ja: forward Invocation:に対するNSObjectの持つ実装は、単純にdoes Not Recognize Selector:メソッドを発動します；それはどんなメッセージも転送しません。

source: NSOrdered Descending if left Operand is bigger than right Operand; NSOrdered Ascending if right Operand is bigger than left Operand; or NSOrdered Same if the two operands are equal.
ja: NSOrdered Descending、もしleft Operandがright Operandより大きいならば；NSOrdered Ascending、もしright Operandがleft Operandより大きいならば；またはNSOrdered Same、もし２つの演算数が等しいならば。

source: NSRegular Expression also provides simple methods for performing find-and-replace operations on a string.
ja: NSRegular Expressionはまた、単純なメソッドを検索置換操作を文字列において実行するために提供します。

source: NSRegular Expression implements a nondeterministic finite automaton matching engine.
ja: NSRegular Expressionは、ある非決定性有限オートマトンマッチエンジンを実装します。

source: NSRegular Expression is designed to be immutable and thread safe, so that a single instance can be used in matching operations on multiple threads at once.
ja: NSRegular Expressionはイミュータブル（不変）でスレッドセーフに設計されます、そのため単一のインスタンスが同時に複数のスレッドの上でのマッチング操作で使われることができます。

source: NSUTF16String Encoding encoding with explicit endianness specified.
ja: NSUTF16String Encoding 符号化、明示的なエンディアンなし指定で。

source: NSUTF32String Encoding encoding with explicit endianness specified.
ja: NSUTF32String Encoding 符号化、明示的なエンディアンなし指定で。

source: a .compare(b) would return .Ordered Ascending because a’s start date is earlier in time than b’s start date.
ja: a .compare(b)は、.Ordered Ascendingを返します、なぜなら a の開始日付は b の開始日付より時間でより早いからです。

source: apple Event(for Suspension ID:) may be invoked in any thread, not just the one in which the corresponding invocation of suspend Current Apple Event() occurred.
ja: apple Event(for Suspension ID:)は、該当するsuspend Current Apple Event()の発動が起こったものだけでなく、どのスレッドで発動されてもかまいません。

source: are Equivalent(a, a) is always true.
ja: are Equivalent(a, a)は常にtrueである。

source: are Equivalent(a, b) implies are Equivalent(b, a).
ja: are Equivalent(a, b)はare Equivalent(b, a)を意味する。

source: are In Increasing Order(a, a) is always false.
ja: are In Increasing Order(a, a)は常にfalseである。

source: c .compare(d) would result in .Ordered Descending because c is longer than d.
ja: c .compare(d)は、.Ordered Descendingという結果になります、なぜなら c は d より長いからです。

source: coercer should typically be a class object.
ja: coercerは、一般的にクラスオブジェクトであるべきです。

source: end must be a valid index of the collection that is not equal to the end Index property.
ja: endはコレクションの有効なインデックスで、end Indexプロパティと等しくないものでなければなりません。

source: end must be a valid index of the collection.
ja: endはコレクションのひとつの有効なインデックスでなければなりません。

source: false if enumerator has already iterated over all the elements in the table that enumerator is associated with; otherwise, sets key and value to match the next key-value pair in the table and returns true.
ja: false、もしenumeratorがenumeratorが関連付けられるテーブルの中の全ての要素に既に反復処理したならば；そうでなければkeyとvalueをテーブルの中の次のキー値ペアに合致するよう設定します、そしてtrueを返します。

source: false if the value in dcm represents a valid number, otherwise true.
ja: false、もしdcmの中の値が有効な数を表すならば、そうでなければtrue。

source: false to overwrite an existing file and ignore incomplete writes.
ja: 既存のファイルを上書きするそして不完全な書き出しを無視するにはfalse。

source: false to specify that the receiver’s filenames not be updated.
ja: falseで、レシーバの持つファイル名が更新されないことを指定します。

source: false when the file wrapper needs to be updated to match node, false otherwise.
ja: false、ファイルラッパーがnodeと合致するよう更新される必要がある場合は、そうでなければfalse。

source: finalize methods must be thread-safe.
ja: finalizeメソッドはスレッド安全である必要があります。

source: i must be greater than start Index.
ja: iはstart Indexより大きくなければなりません。

source: i must be less than end Index.
ja: iはend Indexより少なくなければなりません。

source: index must be a valid index into the collection.
ja: indexはコレクションに対する有効なインデックスでなければなりません。

source: index must be a valid index of the collection.
ja: indexはコレクションの有効なインデックスでなければなりません。

source: initial Result is passed to next Partial Result the first time the closure is executed.
ja: initial Resultはnext Partial Resultに、クロージャが実行される最初の時に渡されます。

source: key is compared with not AKey Marker using pointer comparison; if key is identical to not AKey Marker, raises NSInvalid Argument Exception.
ja: keyはnot AKey Markerとポインタ比較を使って比較されます；keyがnot AKey Markerと同一ならば、NSInvalid Argument Exceptionが引き起こされます。

source: max Length must be greater than or equal to zero.
ja: max Lengthは、ゼロより大きいか等しくなければなりません。

source: n must be greater than or equal to zero and must not exceed the number of elements in the collection.
ja: nは、ゼロより大きいか等しくなければなりません、そしてコレクションの中の要素の数を超えてはいけません。

source: n must be greater than or equal to zero, and must be less than or equal to the number of elements in the collection.
ja: nは、ゼロより大きいか等しくなければなりません、そしてコレクションの要素数より少ないか等しくなければなりません。

source: n must be greater than or equal to zero.
ja: nは、ゼロより大きいか等しくなければなりません。

source: nil if there is no user info dictionary.
ja: ユーザ情報辞書がないならばnil。

source: options can be 0 or NSScanned Option: A value of 0 allocates non-scanned memory; a value of NSScanned Option allocates scanned memory.
ja: optionsは、0またはNSScanned Optionであることができます：0の値は、非スキャンメモリをアロケートします；NSScanned Optionの値は、スキャンメモリをアロケートします。

source: position must be a valid index of the collection that is not equal to the collection’s end index.
ja: positionは、このコレクションの有効なインデックスでなければなりません、そしてこのコレクションの持つ末尾インデックスと等しくてはなりません。

source: reply Apple Event(for Suspension ID:) may be invoked in any thread, not just the one in which the corresponding invocation of suspend Current Apple Event() occurred.
ja: reply Apple Event(for Suspension ID:)は、該当するsuspend Current Apple Event()の発動が起こったものだけでなく、どのスレッドで発動されてもかまいません。

source: selector should typically be a factory method, and must take two arguments.
ja: selectorは、一般的にファクトリメソッドであるべきです、そして２つの引数を取らなければなりません。

source: slice and rem must not be NULL.
ja: sliceとremは、NULLであってはなりません。

source: start must be a valid index of the collection.
ja: startはコレクションのひとつの有効なインデックスでなければなりません。

source: transform accepts an element of this sequence as its parameter and returns a transformed value of the same or of a different type.
ja: transformはこのシーケンスのひとつの要素をそれのパラメータとして受け取り、同じもしくは異なる型の変換された値を返します。

source: true for success or if the script was already compiled, false otherwise.
ja: 成功またはスクリプトが既にコンパイルされたならばtrue、そうでないならfalse。

source: true if a Point is located within the rectangle represented by a Rect, otherwise false.
ja: true、もしa Pointがa Rectによって表される矩形内に位置するならば、そうでなければfalse。

source: true if a Rect and b Rect are identical, otherwise false.
ja: true、もしa Rectとb Rectが同一ならば、そうでなければfalse。

source: true if a Rect completely encloses b Rect.
ja: true、もしa Rectがb Rectを完全に取り囲むならば。

source: true if a Rect encloses no area at all—that is, if its width or height is 0 or negative, otherwise false.
ja: true、もしa Rectが全く面を囲まないならば — すなわち、それの幅または高さがゼロまたは負ならば、そうでなければfalse。

source: true if a Rect intersects b Rect, otherwise false.
ja: true、もしa Rectがb Rectと交差するならば、そうでなければfalse。

source: true if a Size and b Size are identical, otherwise false.
ja: true、もしa Sizeとb Sizeが同一ならば、そうでなければfalse。
